andrewmrobinson/Hydraulic-Mimic-Arm/PSOC_arm_project.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "CyScBoostClk.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "UART.h"
#include "LED_aliases.h"
#include "LED.h"
#include "SW2_aliases.h"
#include "SW2.h"
#include "isr_rx.h"
#include "PWM_1.h"
#include "Clock_1.h"
#include "pwm1_aliases.h"
#include "pwm1.h"
#include "ADC_SAR_1.h"
#include "adc_in_aliases.h"
#include "adc_in.h"
#include "ADC_SAR_2.h"
#include "adc_in_1_aliases.h"
#include "adc_in_1.h"
#include "timer_clock.h"
#include "Timer_1.h"
#include "median_timer.h"
#include "update_median_isr.h"
#include "UART_IntClock.h"
#include "ADC_SAR_1_IRQ.h"
#include "ADC_SAR_1_theACLK.h"
#include "ADC_SAR_1_Bypass_aliases.h"
#include "ADC_SAR_1_Bypass.h"
#include "ADC_SAR_2_IRQ.h"
#include "ADC_SAR_2_theACLK.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

